# Assignment

Q1. Write the Python program to add, subtract, multiply and divide
two pandas series ?

    Sample Series- [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [8]:
import pandas as pd
pd1=pd.Series([2, 4, 6, 8, 10])
pd2=pd.Series( [1, 3, 5, 7, 9])
pd3=pd1-pd2
print('subtraction is :')
print(pd3)
pd3=pd1+pd2
print('Addition is :')
print(pd3)
pd3=pd1*pd2
print('multiplication is :')
print(pd3)
pd3=pd1/pd2

print("division is")
pd3

subtraction is :
0    1
1    1
2    1
3    1
4    1
dtype: int64
Addition is :
0     3
1     7
2    11
3    15
4    19
dtype: int64
multiplication is :
0     2
1    12
2    30
3    56
4    90
dtype: int64
division is

0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

Q2. Write a Python program to convert a dictionary to the Pandas
Series?
    
    Sample SeriesOriginal dictionary-
    {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
    Converted series -
    a 100
    b 200
    c 300
    d 400
    e 800
    dtype- int64

In [13]:
d= {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
print("series is:")
pd.Series(d)

series is:

a    100
b    200
c    300
d    400
e    800
dtype: int64

Q3. Write a python program to change the data type of given a
column or a Series?

    Sample SeriesOriginal Data Series0 100
    1 200
    2 python
    3 300.12
    4 400
    dtype- object
    Change the said data type to numeric0 100.00
    1 200.00
    2 NaN
    3 300.12
    4 400.00
    dtype- float64

In [9]:
import pandas as pd
ds1=pd.Series(['100','200','python','300.12','400'])
print(ds1)
ds2=pd.to_numeric(ds1,errors='coerce')
ds2

0       100
1       200
2    python
3    300.12
4       400
dtype: object

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

Q4. Write the python pandas program to convert the first column of a
DataFrame as a Series?

    Sample OutputOriginal DataFramecol1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    3 4 9 12
    4 7 5 1
    5 11 0 11
    1st column as a Series0 1
    1 2
    2 3
    3 4
    4 7
    5 11
    Name- col1, dtype- int64
    <class 'pandas.core.series.Series'>

In [16]:
d={
               'col1':[1,2,3,4,7,11],
               'col2':[4,5,6,9,5,0],
               'col3':[7,5,8,12,1,11]
               }
df= pd.DataFrame(d)
col1=df['col1']
print(col1)
type(col1)

0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64

pandas.core.series.Series

Q5. Write a pandas program to create the mean and standard
deviation of the data of a given Series?

    Sample OutputOriginal Data Series0 1
    1 2
    2 3
    3 4
    4 5
    5 6
    6 7
    7 8
    8 9
    9 5
    10 3
    dtype- int64
    Mean of the said Data Series4.81818181818
    Standard deviation of the said Data Series2.52262489555

In [20]:
s=pd.Series([1,2,3,4,5,6,7,8,9,5,3])
print('Mean of the said Data Series',s.mean())
print('Standard deviation of the said Data Series',s.std())

Mean of the said Data Series 4.818181818181818
Standard deviation of the said Data Series 2.522624895547565

Q6. Write a pandas program to get powers of an array values
element-wise?
 
Note First array elements raised the powers from the second array.

    Sample data: {'X ':[78,85,96,80,86], ' Y ':[84,94,89,83,86],'Z':[86,97,96,72,83]}
    Expected Output:
    X Y Z
    0 78 84 86
    1 85 94 97
    2 96 89 96
    3 80 83 72
    4 86 86 83

In [9]:
import pandas as pd
data= {'X':[78,85,96,80,86],
       'Y':[84,94,89,83,86],
      'Z':[86,97,96,72,83]}
df=pd.DataFrame(data)
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

Q7. Write the pandas program to get the first 3 rows of a given
DataFrame?

    Sample Python dictionary data and list labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- [ 'yes', 'no', 'yes' , 'no', ' no ', ' yes ', 'yes', 'no', 'no', 'yes' ] }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j' ]
    Expected OutputFirst three rows of the data frameattempts name qualify score
    a 1 Anastasia yes 12.5
    b 3 Dima no 9.0
    c 2 Katherine yes 16.5

In [12]:
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael','Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts':[1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': [ 'yes', 'no', 'yes' , 'no', ' no ', ' yes ', 'yes', 'no', 'no', 'yes' ] }
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j' ]

In [15]:
exam= pd.DataFrame(exam_data,index=labels)
exam[:3]

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

Q8: Write the pandas program to select the specified columns and
the rows from a given data frame?

    Sample Python dictionary data and list labelsSelect 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.
    exam_data = {'name ': [ 'Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score'- [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'] }
    labels = ['a ', ' b ', ' c ', ' d ', ' e ', ' f ', ' g ', 'h', 'i', 'j']
    Expected OutputSelect specific columns and rowsname score
    b Dima 9.0
    d James NaN
    f Michael 20.0
    g Matthew 14.5

In [19]:
exam.iloc[[1,3,5,6],[1,3]]  ## 1,3 ,5,6 are for rows and 1,3 are for column vales of names and score

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

Q9. Write the pandas program to calculate mean score for each
different student in DataFrame?

    Sample Python dictionary data and list labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- ['yes', 'no', ' yes ', ' no ', ' no ', ' yes ', ' yes ', ' no ', ' no ', ' yes '] }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
    Expected OutputMean score for each different student in data frame:
    13.5625

In [20]:
exam.score.mean()

13.5625

Q10. Write the Pandas program to rename columns of a given
DataFrame ?

    Sample dataOriginal data frame
    col1 col2 col3
    0 1 4 7
    1 2 5 8
    2 3 6 9
    New data frame after renaming columns:
    Column1 Column2 Column3
    0 1 4 7
    1 2 5 8
    2 3 6 9

In [37]:
l=[ [1,4,7],[2, 5,8],[3,6,9]]
df=pd.DataFrame(l,columns=['col1','col2','col3'])
print('original dataframe is  :')
print(df)
df=df.rename(columns={'col1':'Column1','col2':'Column2','col3':'Column3'})
print('New data frame after renaming columns:')
print(df)

original dataframe is  :
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9
New data frame after renaming columns:
   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

Q11. Write a pandas program to count city-wise number of people from
a given of data set (city, name of the person)?

    Sample data-
    city Number of people
    0 California 4
    1 Georgia 2
    2 Los Angeles 4

In [52]:
samp= {'Ram':'Delhi',
                    'Akash':'Delhi',
                    'disha': 'California',
                    "Daisy" : 'Los Angeles',
                    'Martin': 'California',
                    'Dona':'Georgia',
                    'Vicky': 'Georgia',
                    "Lalit": 'Georgia'}
labels=['person','city']
data =pd.Series(samp).to_frame().reset_index()
data.columns=labels

In [53]:
data

   person         city
0   Akash        Delhi
1   Daisy  Los Angeles
2    Dona      Georgia
3   Lalit      Georgia
4  Martin   California
5     Ram        Delhi
6   Vicky      Georgia
7   disha   California

In [57]:
data.groupby('city')['person'].count()

city
California     2
Delhi          2
Georgia        3
Los Angeles    1
Name: person, dtype: int64

Q12. Write a pandas program to widen output display to see more
columns?
    
    Sample dataOriginal data frame
    col1 col2 col3
    0 1 4 7
    1 4 5 8
    2 3 6 9
    3 4 7 0
    4 5 8 1

In [59]:
import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)

pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 100)
print("Original DataFrame")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Q13. Write a pandas program to convert the data frame column type
from string to DateTime?
    
    Sample dataString Date0 3/11/2000
    1 3/12/2000
    2 3/13/2000
    dtype- object
    Original DataFrame (string to datetime)-
    0
    0 2000-03-11
    1 2000-03-12
    2 2000-03-13

In [65]:
data =['3/11/2000',
' 3/12/2000',
 '3/13/2000']
date=pd.Series(data)
print(date)
print('string to datetime')
date=pd.to_datetime(date)
print(date)

0     3/11/2000
1     3/12/2000
2     3/13/2000
dtype: object
string to datetime
0   2000-03-11
1   2000-03-12
2   2000-03-13
dtype: datetime64[ns]

Q14. Write a pandas program to append the data to an empty
DataFrame?

    Sample dataOriginal DataFrame- After appending some data: col1 col2 0 0 0 1 1 1 2 2 2

In [68]:
df = pd.DataFrame()
data = pd.DataFrame({"col1": range(3),"col2": range(3)})
print("After appending some data:")
df = df.append(data)
print(df)

After appending some data:
   col1  col2
0     0     0
1     1     1
2     2     2

Q15. Write a pandas program to count the number of columns of a
DataFrame?

    Sample OutputOriginal DataFrame
    col1 col2 col3
    0 1 4 7
    1 2 5 8
    2 3 6 12
    3 4 9 1
    4 7 5 11
    Number of columns- 3

In [78]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 5,8,12,1]}
df = pd.DataFrame(d)
df
print('no of column' ,df.shape[1])

no of column 3

Q16. Write a Pandas program to remove the last n rows of a given
DataFrame ?

    Sample Output:
    Original DataFrame
    col1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    3 4 9 12
    4 7 5 1
    5 11 0 11
    After removing last 3 rows of the said DataFramecol1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    
     Link for Datasets
     (https://drive.google.com/drive/folders/105ftuIwN9kqyPNEEm3E6IM7LqywjyvJa?usp=sharing)

In [79]:
print("original dataframe")
print(df)
d= df[:-2]
print(d)

original dataframe
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8

Q17. Write a Pandas program to import excel data (coalpublic2013.xlsx
) into a Pandas data frame.

In [84]:
d =pd.read_excel(r'C:/Users/aksha.LAPTOP-KKEAULMJ/OneDrive/Documents/Python/Ineuron/assignment/coalpublic2013.xlsx')

Q18. Write a Pandas program to import excel data (coalpublic2013.xlsx
) into a data frame and find details where "Mine Name" starts with
"P.

In [91]:
d_name=d.loc[d['Mine_Name'].str.startswith('P')]
d_name

    Year  MSHA ID                      Mine_Name  Production  Labor_Hours
13  2013   103332                  Powhatan Mine      140521        61394
18  2013   102976  Piney Woods Preparation Plant           0        14828
19  2013   102976  Piney Woods Preparation Plant           0        23193
46  2013   103321                 Poplar Springs      189370        76366

Q19. Write a Pandas program to import excel data (employee.xlsx )
into a Pandas dataframe and find the list of employees where
hire_date> 01-01-07.

In [1]:
import pandas as pd

In [2]:
d= pd.concat(pd.read_excel(r'C:/Users/aksha.LAPTOP-KKEAULMJ/OneDrive/Documents/Python/Ineuron/assignment/employee.xlsx',sheet_name=None))

In [52]:
d.dtypes

emp_id                 int64
first_name            object
last_name             object
hire_date     datetime64[ns]
dtype: object

In [98]:
d_hire=d.loc[d.hire_date>'2007-01-01']
d_hire

           emp_id first_name   last_name  hire_date
Sheet1 4      104      Bruce       Ernst 2007-05-21
       7      107      Diana     Lorentz 2007-02-07
       13     113       Luis        Popp 2007-12-07
       19     119      Karen  Colmenares 2007-08-10
Sheet2 4      124      Kevin     Mourgos 2007-11-16
       7      127      James      Landry 2007-01-14
       8      128     Steven      Markle 2008-03-08
       12     132         TJ       Olson 2007-04-10
       15     135         Ki         Gee 2007-12-12
       16     136      Hazel  Philtanker 2008-02-06
Sheet3 7      148     Gerald   Cambrault 2007-10-15
       8      149      Eleni     Zlotkey 2008-01-29

Q20. Write a Pandas program to import excel data (employee.xlsx )
into a Pandas dataframe and find a list of the employees of a specified
year

In [91]:

def year(df,yr):
    #df=df.set_index('hire_date')
    yr=input('Which year employees you want to view')
    return df[df['hire_date'].astype(str).str.contains(yr)]

In [94]:
year(d,year)

Which year employees you want to view2007

           emp_id first_name   last_name  hire_date
Sheet1 4    104.0      Bruce       Ernst 2007-05-21
       7    107.0      Diana     Lorentz 2007-02-07
       13   113.0       Luis        Popp 2007-12-07
       19   119.0      Karen  Colmenares 2007-08-10
Sheet2 4    124.0      Kevin     Mourgos 2007-11-16
       7    127.0      James      Landry 2007-01-14
       12   132.0         TJ       Olson 2007-04-10
       15   135.0         Ki         Gee 2007-12-12
Sheet3 7    148.0     Gerald   Cambrault 2007-10-15

## Great Job!